In [2]:
import pandas as pd

In [3]:
"11, 12, 13, 14".split()

['11,', '12,', '13,', '14']

In [4]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (8, 10, 11, 12),
        (13, 14, 15, 16)]

df = pd.DataFrame(data, "11 12 13 14".split(), "c1 c2 c3 c4".split())

In [6]:
df

    c1  c2  c3  c4
11   1   2   3   4
12   5   6   7   8
13   8  10  11  12
14  13  14  15  16

In [7]:
df["c1"]

11     1
12     5
13     8
14    13
Name: c1, dtype: int64

In [8]:
df[1:3]

    c1  c2  c3  c4
12   5   6   7   8
13   8  10  11  12

In [9]:
df[1:][['c3', 'c1']]

    c3  c1
12   7   5
13  11   8
14  15  13

In [10]:
df["c3"]

11     3
12     7
13    11
14    15
Name: c3, dtype: int64

In [13]:
df.loc[['13', '12']]

    c1  c2  c3  c4
13   8  10  11  12
12   5   6   7   8